IDEA StatiCa Open Model
Material.IsDefaultMaterial Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 True if material is default material from the code
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool IsDefaultMaterial { get; set; }
Public Property IsDefaultMaterial As Boolean
	Get
	Set
public:
property bool IsDefaultMaterial {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
Material Class
IdeaRS.OpenModel.Material Namespace